# Data Science - EDA using Titanic Dataset
[필수조건]
1. 아래의 가설 검증 및 시각화 
1-A 항구에 따라 사망자수의 차이가 있다.
1-B 남성일 경우 사망자가 많다.
1-C 사회적 계층(객실, 요금 등)이 높을수록 사망자가 감소하는 경향이 있다.
1-D 연령이 낮은 경우 사망자가 적으며, 성인의 경우 큰 차이는 없다.
 
2. Target Label인 'Survived'를 제외한 총 11개의 Feature중
   어떤 feature를 고려하면 강력한 Insight를 얻을 수 있을지 EDA 과정 상세하게 출력 (주석 기입) 
 
3. 차별화된 나의 방법 및 결론
- 본인이 생각했을 때 친구들과 비교하여 (타 사이트 등), 내가 특별히 사용한 방법, 나만이 도출했다 생각한 가설, 나만이 구현한 시각화 결과 등 자유롭게 기술
 
4. 끝 부분: 본 과제를 통해 느낀점 기술

### 주요 Column 설명
- PassengerId : Passenger's unique number
- Pclass : 객실 class(1st class, 2nd class, 3rd class)
- SibSp : Sibling + Spouse (동승한 형제자매 + 배우자)
- Parch : Parents + Children (함께 탑승한 부모, 아이의 수)
- Ticket : Ticket number
- Fare : 탑승 요금
- Cabin : 객실 번호 (그러나 공백도 많고 정확한 기준을 알 수 없음)
- Embarked : 탑승 항구 (C=Cherbourg, Q=Queenstown, S=Southampton)

In [1]:
import pandas as pd

## 1. Data load

In [3]:
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64